CS-4331/notes/html_output/1 - UAV Types.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-01-17 Fri 16:31 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>UAV Types</title>
<meta name="author" content="Kieran Lavato" />
<meta name="generator" content="Org Mode" />

</head>
<body>
<div id="content" class="content">
<h1 class="title">UAV Types</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org1b96d18">1. DJI Types</a>
<ul>
<li><a href="#orgcc90b28">1.1. DJI Tello</a>
<ul>
<li><a href="#orgf5cfda8">1.1.1. Issues with DJI</a></li>
</ul>
</li>
<li><a href="#orgee1d2c4">1.2. DJI Mavic II Enterprise</a></li>
<li><a href="#org03d4881">1.3. DJI Inspire</a></li>
<li><a href="#org91249a4">1.4. Other</a></li>
</ul>
</li>
<li><a href="#org348a2c7">2. Info regarding</a>
<ul>
<li><a href="#org1b0f79e">2.1. UAV TYPOLOGY</a></li>
<li><a href="#org3412488">2.2. CLASSES OF QUADCOPTERS</a></li>
<li><a href="#orgadcfff9">2.3. FIXED WING &amp; HELICOPTERS</a></li>
<li><a href="#org60bbed5">2.4. Imaging payload options</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org1b96d18" class="outline-2">
<h2 id="org1b96d18"><span class="section-number-2">1.</span> DJI Types</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgcc90b28" class="outline-3">
<h3 id="orgcc90b28"><span class="section-number-3">1.1.</span> DJI Tello</h3>
<div class="outline-text-3" id="text-1-1">
<p>
DJI is the primere company that makes recreation hobby drones, all the way up to professional drones.\n<br />
The small one is used for recreational purposes.<br />
</p>
</div>
<div id="outline-container-orgf5cfda8" class="outline-4">
<h4 id="orgf5cfda8"><span class="section-number-4">1.1.1.</span> Issues with DJI</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
A Chinese company. Concerns that the video is sent back to china (telemetry and such.)<br />
Federal government banned universities buying DJI products.<br />
</p>
</div>
</div>
</div>
<div id="outline-container-orgee1d2c4" class="outline-3">
<h3 id="orgee1d2c4"><span class="section-number-3">1.2.</span> DJI Mavic II Enterprise</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Can fold into a small handheld device. Easy and compact for travel.\n<br />
Around <b>$7000</b> for the whole package (including the remote control.)\n<br />
Lots of different attachments. Different canera systems between different models.<br />
</p>
</div>
</div>
<div id="outline-container-org03d4881" class="outline-3">
<h3 id="org03d4881"><span class="section-number-3">1.3.</span> DJI Inspire</h3>
<div class="outline-text-3" id="text-1-3">
<p>
One of the first models of DJI cameras. Allows two operators.<br />
</p>
<ul class="org-ul">
<li>Drone operator<br /></li>
<li>Camera operator<br /></li>
</ul>
</div>
</div>
<div id="outline-container-org91249a4" class="outline-3">
<h3 id="org91249a4"><span class="section-number-3">1.4.</span> Other</h3>
<div class="outline-text-3" id="text-1-4">
<ul class="org-ul">
<li>Parrot<br /></li>
<li>Sony<br /></li>
<li>DJI AGRAS (Farming drones)<br /></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org348a2c7" class="outline-2">
<h2 id="org348a2c7"><span class="section-number-2">2.</span> Info regarding</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org1b0f79e" class="outline-3">
<h3 id="org1b0f79e"><span class="section-number-3">2.1.</span> UAV TYPOLOGY</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li>RC Helicopter<br /></li>
<li>Coaxial Helicopter<br /></li>
<li>Hexacopter<br /></li>
<li>Quadcopter<br /></li>
<li>Octocopter<br /></li>
<li>Y6<br /></li>
<li>Tricopter<br /></li>
<li>Coax<br /></li>
</ul>
</div>
</div>
<div id="outline-container-org3412488" class="outline-3">
<h3 id="org3412488"><span class="section-number-3">2.2.</span> CLASSES OF QUADCOPTERS</h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li>Whoop (camera on top)<br /></li>
<li>Camera/Video<br /></li>
<li>Large<br /></li>
<li>Nano<br /></li>
<li>Racing<br /></li>
<li>Cinema<br /></li>
</ul>
</div>
</div>
<div id="outline-container-orgadcfff9" class="outline-3">
<h3 id="orgadcfff9"><span class="section-number-3">2.3.</span> FIXED WING &amp; HELICOPTERS</h3>
<div class="outline-text-3" id="text-2-3">
<ul class="org-ul">
<li>Quantum Systems Trinity F90+<br /></li>
<li>Censys Technologies<br />
<ul class="org-ul">
<li>Flown in line-of-sight<br /></li>
<li>Could see a couple miles, but not which direction it&rsquo;s facing.<br /></li>
<li>Range around 55 miles. 45 mph<br /></li>
<li>15 mph in max winds<br /></li>
</ul></li>
<li>Skyeton<br /></li>
<li>UAVOS SAT-I<br />
<ul class="org-ul">
<li>Huge wingspan.<br /></li>
<li>Proprietary autopilot.<br /></li>
<li>8 m/s<br /></li>
</ul></li>
<li>Standard UAVOS<br />
<ul class="org-ul">
<li>$1,000,000<br /></li>
<li>Hella expensive.<br /></li>
</ul></li>
<li>&ldquo;Wing&rdquo;<br />
<ul class="org-ul">
<li>Able to carry 1.5 kg<br /></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org60bbed5" class="outline-3">
<h3 id="org60bbed5"><span class="section-number-3">2.4.</span> Imaging payload options</h3>
<div class="outline-text-3" id="text-2-4">
<ul class="org-ul">
<li>Sony A7RIII<br /></li>
<li>Sony A6400<br /></li>
<li>M2-DG64-HD EO/IR<br /></li>
<li>MicaSense RedEdge-MX (agriculture)<br /></li>
<li>Phase One<br /></li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Kieran Lavato</p>
<p class="date">Created: 2025-01-17 Fri 16:31</p>
</div>
</body>
</html>
